cases/openfoam/fluids/nasa_hump_separated/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
        patches         (wall_hump wall_down);
    }

    // Sample wallShearStress + p on the hump and downstream patches.
    wallSurfaceSample
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (wallShearStress p);
        surfaces
        {
            humpSurface
            {
                type    patch;
                patches (wall_hump);
                interpolate false;
            }
            downSurface
            {
                type    patch;
                patches (wall_down);
                interpolate false;
            }
        }
    }
}
