cases/openfoam/fluids/nasa_hump_separated/solution/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Generated by gen_blockmesh.py - do not hand-edit; regenerate instead.

scale   1;

vertices
(
    ( -2.140000   0.000000   0.00)    // 0
    (  0.000000   0.000000   0.00)    // 1
    (  1.000000   0.000000   0.00)    // 2
    (  4.000000   0.000000   0.00)    // 3
    ( -2.140000   0.910000   0.00)    // 4
    (  0.000000   0.910000   0.00)    // 5
    (  1.000000   0.910000   0.00)    // 6
    (  4.000000   0.910000   0.00)    // 7
    ( -2.140000   0.000000   1.00)    // 8
    (  0.000000   0.000000   1.00)    // 9
    (  1.000000   0.000000   1.00)    // 10
    (  4.000000   0.000000   1.00)    // 11
    ( -2.140000   0.910000   1.00)    // 12
    (  0.000000   0.910000   1.00)    // 13
    (  1.000000   0.910000   1.00)    // 14
    (  4.000000   0.910000   1.00)    // 15
);

blocks
(
    hex (0 1 5 4 8 9 13 12)  (100 110 1) simpleGrading (0.1 5000 1)
    hex (1 2 6 5 9 10 14 13)  (220 110 1) simpleGrading (1 5000 1)
    hex (2 3 7 6 10 11 15 14)  (160 110 1) simpleGrading (10 5000 1)
);

edges
(
    polyLine 1 2
    (
        (0.025000 0.004000 0.0)
        (0.050000 0.014500 0.0)
        (0.075000 0.028500 0.0)
        (0.100000 0.043200 0.0)
        (0.125000 0.059500 0.0)
        (0.150000 0.076000 0.0)
        (0.175000 0.092000 0.0)
        (0.200000 0.105000 0.0)
        (0.225000 0.115000 0.0)
        (0.250000 0.121000 0.0)
        (0.275000 0.123000 0.0)
        (0.300000 0.123400 0.0)
        (0.325000 0.123300 0.0)
        (0.350000 0.122800 0.0)
        (0.375000 0.122300 0.0)
        (0.400000 0.121600 0.0)
        (0.425000 0.120800 0.0)
        (0.450000 0.119600 0.0)
        (0.475000 0.117900 0.0)
        (0.500000 0.115300 0.0)
        (0.525000 0.113200 0.0)
        (0.550000 0.110500 0.0)
        (0.575000 0.107500 0.0)
        (0.600000 0.103700 0.0)
        (0.625000 0.099200 0.0)
        (0.650000 0.094200 0.0)
        (0.675000 0.088100 0.0)
        (0.700000 0.080900 0.0)
        (0.725000 0.073000 0.0)
        (0.750000 0.064100 0.0)
        (0.775000 0.054500 0.0)
        (0.800000 0.043800 0.0)
        (0.825000 0.032500 0.0)
        (0.850000 0.020300 0.0)
        (0.875000 0.010000 0.0)
        (0.900000 0.004000 0.0)
        (0.925000 0.002000 0.0)
        (0.950000 0.001500 0.0)
        (0.975000 0.001000 0.0)
    )
    polyLine 9 10
    (
        (0.025000 0.004000 1.0)
        (0.050000 0.014500 1.0)
        (0.075000 0.028500 1.0)
        (0.100000 0.043200 1.0)
        (0.125000 0.059500 1.0)
        (0.150000 0.076000 1.0)
        (0.175000 0.092000 1.0)
        (0.200000 0.105000 1.0)
        (0.225000 0.115000 1.0)
        (0.250000 0.121000 1.0)
        (0.275000 0.123000 1.0)
        (0.300000 0.123400 1.0)
        (0.325000 0.123300 1.0)
        (0.350000 0.122800 1.0)
        (0.375000 0.122300 1.0)
        (0.400000 0.121600 1.0)
        (0.425000 0.120800 1.0)
        (0.450000 0.119600 1.0)
        (0.475000 0.117900 1.0)
        (0.500000 0.115300 1.0)
        (0.525000 0.113200 1.0)
        (0.550000 0.110500 1.0)
        (0.575000 0.107500 1.0)
        (0.600000 0.103700 1.0)
        (0.625000 0.099200 1.0)
        (0.650000 0.094200 1.0)
        (0.675000 0.088100 1.0)
        (0.700000 0.080900 1.0)
        (0.725000 0.073000 1.0)
        (0.750000 0.064100 1.0)
        (0.775000 0.054500 1.0)
        (0.800000 0.043800 1.0)
        (0.825000 0.032500 1.0)
        (0.850000 0.020300 1.0)
        (0.875000 0.010000 1.0)
        (0.900000 0.004000 1.0)
        (0.925000 0.002000 1.0)
        (0.950000 0.001500 1.0)
        (0.975000 0.001000 1.0)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 8 12 4));
    }
    outlet
    {
        type patch;
        faces ((3 7 15 11));
    }
    wall_up
    {
        type wall;
        faces ((0 1 9 8));
    }
    wall_hump
    {
        type wall;
        faces ((1 2 10 9));
    }
    wall_down
    {
        type wall;
        faces ((2 3 11 10));
    }
    top
    {
        type symmetry;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
);

mergePatchPairs ();
