cases/openfoam/fluids/nasa_hump_separated/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Incompressible. Re_c = U*c/nu = 34.6 * 1 / 3.7e-5 ~ 9.36e5 (CFDVAL2004 baseline).
// At M=0.1 the incompressible-vs-compressible difference for Cp/Cf is <1%.

transportModel  Newtonian;

nu              3.7e-05;
