cases/openfoam/fluids/nasa_hump_separated/solution/case/0/k
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions [0 2 -2 0 0 0 0];

// I = 1% turbulence intensity at U=34.6 -> k = 1.5*(I*U)^2 ~ 0.18
internalField uniform 0.18;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.18;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.18;
        value           uniform 0.18;
    }
    "wall_.*"
    {
        type            kqRWallFunction;
        value           uniform 1e-6;
    }
    top
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}
