cases/openfoam/fluids/nasa_hump_separated/solution/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions [0 0 -1 0 0 0 0];

// Mixing length l = 0.1*c = 0.1; omega = sqrt(k)/(Cmu^0.25 * l) ~ 7.7
internalField uniform 7.7;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7.7;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 7.7;
        value           uniform 7.7;
    }
    "wall_.*"
    {
        type            omegaWallFunction;
        value           uniform 7.7;
    }
    top
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}
